tap "homebrew/cask-fonts"
tap "derailed/k9s"

# essentials
brew "bash"
brew "git"
brew "tmux"
brew "neovim"
brew "htop"
brew "coreutils"
brew "bat"
brew "gh"
brew "gnupg" if OS.mac?

# cli
brew "fd"
brew "ripgrep"
brew "fzf"
brew "gawk"
brew "lsd"
brew "duf"
brew "procs"
brew "lazygit"
brew "starship"
brew "gnu-sed"
brew "git-delta"
brew "navi"

# dev stuff
brew "wget"
brew "curl"
brew "jq"
brew "scc"
brew "tldr"
brew "hyperfine"
brew "httpie"
brew "http-prompt"
brew "sqlite"
brew "direnv"
brew "tree"

# work
brew "awscli"
brew "libpq"
brew "pipenv"
brew "pyenv"
brew "aws-iam-authenticator"
brew "circleci"
cask "1password-cli"
cask "zoom"
cask "insomnia"

# other
brew "nvm"
brew "dog" # better dig
brew "asciinema" # record terminal
brew "vale"

# kubernetes & docker
brew "kubernetes-cli"
brew "helm"
brew "istioctl"
brew "derailed/k9s/k9s"
brew "tfk8s"
